dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxCan_reg.h
/** \brief A94, High Priority Message Status 2 */
#define CAN0_N2_HPMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0208A94u)
/** Alias (User Manual Name) for CAN0_N2_HPMS.
* To use register names with standard convension, please use CAN0_N2_HPMS.
*/
#define CAN0_HPMS2 (CAN0_N2_HPMS)

/** \brief A98, New Data 1 2 */
#define CAN0_N2_NDAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0208A98u)
/** Alias (User Manual Name) for CAN0_N2_NDAT1.
* To use register names with standard convension, please use CAN0_N2_NDAT1.
*/
#define CAN0_NDAT12 (CAN0_N2_NDAT1)

/** \brief A9C, New Data 2 2 */
#define CAN0_N2_NDAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF0208A9Cu)
/** Alias (User Manual Name) for CAN0_N2_NDAT2.
* To use register names with standard convension, please use CAN0_N2_NDAT2.
*/
#define CAN0_NDAT22 (CAN0_N2_NDAT2)

/** \brief AA0, Rx FIFO 0 Configuration 2 */
#define CAN0_N2_RX_F0C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF0208AA0u)
/** Alias (User Manual Name) for CAN0_N2_RX_F0C.
* To use register names with standard convension, please use CAN0_N2_RX_F0C.
*/
#define CAN0_RXF0C2 (CAN0_N2_RX_F0C)

/** \brief AA4, Rx FIFO 0 Status 2 */
#define CAN0_N2_RX_F0S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF0208AA4u)
/** Alias (User Manual Name) for CAN0_N2_RX_F0S.
* To use register names with standard convension, please use CAN0_N2_RX_F0S.
*/
#define CAN0_RXF0S2 (CAN0_N2_RX_F0S)

/** \brief AA8, Rx FIFO 0 Acknowledge 2 */
#define CAN0_N2_RX_F0A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF0208AA8u)
/** Alias (User Manual Name) for CAN0_N2_RX_F0A.
* To use register names with standard convension, please use CAN0_N2_RX_F0A.
*/
#define CAN0_RXF0A2 (CAN0_N2_RX_F0A)

/** \brief AAC, Rx Buffer Configuration 2 */
#define CAN0_N2_RX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF0208AACu)
/** Alias (User Manual Name) for CAN0_N2_RX_BC.
* To use register names with standard convension, please use CAN0_N2_RX_BC.
*/
#define CAN0_RXBC2 (CAN0_N2_RX_BC)

/** \brief AB0, Rx FIFO 1 Configuration 2 */
#define CAN0_N2_RX_F1C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF0208AB0u)
/** Alias (User Manual Name) for CAN0_N2_RX_F1C.
* To use register names with standard convension, please use CAN0_N2_RX_F1C.
*/
#define CAN0_RXF1C2 (CAN0_N2_RX_F1C)

/** \brief AB4, Rx FIFO 1 Status 2 */
#define CAN0_N2_RX_F1S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF0208AB4u)
/** Alias (User Manual Name) for CAN0_N2_RX_F1S.
* To use register names with standard convension, please use CAN0_N2_RX_F1S.
*/
#define CAN0_RXF1S2 (CAN0_N2_RX_F1S)

/** \brief AB8, Rx FIFO 1 Acknowledge 2 */
#define CAN0_N2_RX_F1A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF0208AB8u)
/** Alias (User Manual Name) for CAN0_N2_RX_F1A.
* To use register names with standard convension, please use CAN0_N2_RX_F1A.
*/
#define CAN0_RXF1A2 (CAN0_N2_RX_F1A)

/** \brief ABC, Rx Buffer/FIFO Element Size Configuration 2 */
#define CAN0_N2_RX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF0208ABCu)
/** Alias (User Manual Name) for CAN0_N2_RX_ESC.
* To use register names with standard convension, please use CAN0_N2_RX_ESC.
*/
#define CAN0_RXESC2 (CAN0_N2_RX_ESC)

/** \brief AC0, Tx Buffer Configuration 2 */
#define CAN0_N2_TX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF0208AC0u)
/** Alias (User Manual Name) for CAN0_N2_TX_BC.
* To use register names with standard convension, please use CAN0_N2_TX_BC.
*/
#define CAN0_TXBC2 (CAN0_N2_TX_BC)

/** \brief AC4, Tx FIFO/Queue Status 2 */
#define CAN0_N2_TX_FQS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF0208AC4u)
/** Alias (User Manual Name) for CAN0_N2_TX_FQS.
* To use register names with standard convension, please use CAN0_N2_TX_FQS.
*/
#define CAN0_TXFQS2 (CAN0_N2_TX_FQS)

/** \brief AC8, Tx Buffer Element Size Configuration 2 */
#define CAN0_N2_TX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF0208AC8u)
/** Alias (User Manual Name) for CAN0_N2_TX_ESC.
* To use register names with standard convension, please use CAN0_N2_TX_ESC.
*/
#define CAN0_TXESC2 (CAN0_N2_TX_ESC)

/** \brief ACC, Tx Buffer Request Pending 2 */
#define CAN0_N2_TX_BRP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF0208ACCu)
/** Alias (User Manual Name) for CAN0_N2_TX_BRP.
* To use register names with standard convension, please use CAN0_N2_TX_BRP.
*/
#define CAN0_TXBRP2 (CAN0_N2_TX_BRP)

/** \brief AD0, Tx Buffer Add Request 2 */
#define CAN0_N2_TX_BAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF0208AD0u)
/** Alias (User Manual Name) for CAN0_N2_TX_BAR.
* To use register names with standard convension, please use CAN0_N2_TX_BAR.
*/
#define CAN0_TXBAR2 (CAN0_N2_TX_BAR)

/** \brief AD4, Tx Buffer Cancellation Request 2 */
#define CAN0_N2_TX_BCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF0208AD4u)
/** Alias (User Manual Name) for CAN0_N2_TX_BCR.
* To use register names with standard convension, please use CAN0_N2_TX_BCR.
*/
#define CAN0_TXBCR2 (CAN0_N2_TX_BCR)

/** \brief AD8, Tx Buffer Transmission Occurred 2 */
#define CAN0_N2_TX_BTO /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF0208AD8u)
/** Alias (User Manual Name) for CAN0_N2_TX_BTO.
* To use register names with standard convension, please use CAN0_N2_TX_BTO.
*/
#define CAN0_TXBTO2 (CAN0_N2_TX_BTO)

/** \brief ADC, Tx Buffer Cancellation Finished 2 */
#define CAN0_N2_TX_BCF /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF0208ADCu)
/** Alias (User Manual Name) for CAN0_N2_TX_BCF.
* To use register names with standard convension, please use CAN0_N2_TX_BCF.
*/
#define CAN0_TXBCF2 (CAN0_N2_TX_BCF)

/** \brief AE0, Tx Buffer Transmission Interrupt Enable 2 */
#define CAN0_N2_TX_BTIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF0208AE0u)
/** Alias (User Manual Name) for CAN0_N2_TX_BTIE.
* To use register names with standard convension, please use CAN0_N2_TX_BTIE.
*/
#define CAN0_TXBTIE2 (CAN0_N2_TX_BTIE)

/** \brief AE4, Tx Buffer Cancellation Finished Interrupt Enable 2 */
#define CAN0_N2_TX_BCIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF0208AE4u)
/** Alias (User Manual Name) for CAN0_N2_TX_BCIE.
* To use register names with standard convension, please use CAN0_N2_TX_BCIE.
*/
#define CAN0_TXBCIE2 (CAN0_N2_TX_BCIE)

